In [1]:
import sys
print(sys.executable)

d:\AI Journey\ai-journey\venv\Scripts\python.exe

In [2]:
import pandas as pd
print(pd.__version__)

3.0.0

In [3]:
import pandas as pd

marks = pd.Series([78, 85, 90, 66, 88])
marks

0    78
1    85
2    90
3    66
4    88
dtype: int64

In [4]:
print(marks.mean())
print(marks.max())
print(marks.min())

81.4
90
66

In [5]:
import pandas as pd


data ={
    "Name": ["Amit", "Riya", "John", "Sara"],
    "Age": [24, 26, 22, 25],
    "Salary": [35000, 42000, 30000, 40000]
}

df = pd.DataFrame(data)
df

   Name  Age  Salary
0  Amit   24   35000
1  Riya   26   42000
2  John   22   30000
3  Sara   25   40000

In [6]:
df["Name"]
df[["Name", "Salary"]]

   Name  Salary
0  Amit   35000
1  Riya   42000
2  John   30000
3  Sara   40000

In [7]:
df.loc[0]
df.loc[1:2]

   Name  Age  Salary
1  Riya   26   42000
2  John   22   30000

In [ ]:
df.loc[0]
df.loc[1:2]

   Name  Age  Salary
1  Riya   26   42000
2  John   22   30000

In [27]:
df["Salary"].mean()
df[df["Age"] > 23]

   Name  Age  Salary
0  Amit   24   35000
1  Riya   26   42000
3  Sara   25   40000

In [30]:
import pandas as pd
df = pd.read_csv("../datasets/employees.csv")
df

   Name  Age  Salary Department
0  Amit   24   35000         HR
1  Riya   26   42000         IT
2  John   22   30000      Sales
3  Sara   25   40000         IT